Repository: dtorresteigell/magic-chef
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: de, es

source: Please enter at least one ingredient
de: Bitte geben Sie mindestens eine Zutat ein
es: Por favor, introduce al menos un ingrediente

source: Dish title is required
de: Gerichttitel ist erforderlich
es: El título del plato es obligatorio

source: Ingredients list is required
de: Zutatenliste ist erforderlich
es: La lista de ingredientes es obligatoria

source: Recipe data is required
de: Rezeptdaten sind erforderlich
es: Los datos de la receta son obligatorios

source: Please log in first.
de: Bitte melden Sie sich zuerst an.
es: Por favor, inicia sesión primero.

source: Recipe saved successfully!
de: Rezept erfolgreich gespeichert!
es: ¡Receta guardada con éxito!

source: Please fill all fields
de: Bitte füllen Sie alle Felder aus
es: Por favor, rellena todos los campos

source: Passwords do not match
de: Passwörter stimmen nicht überein
es: Las contraseñas no coinciden

source: Username or email already exists
de: Benutzername oder E-Mail existiert bereits
es: El nombre de usuario o email ya existe

source: Account created successfully. Please log in.
de: Konto erfolgreich erstellt. Bitte melden Sie sich an.
es: Cuenta creada con éxito. Por favor, inicia sesión.

source: Invalid username or password
de: Ungültiger Benutzername oder Passwort
es: Usuario o contraseña no válidos

source: You have been logged out
de: Sie wurden abgemeldet
es: Has cerrado sesión

source: Password reset link sent! Check your email.
de: Passwort-Reset-Link gesendet! Überprüfen Sie Ihre E-Mail.
es: ¡Enlace de restablecimiento enviado! Revisa tu correo.

source: Email not found.
de: E-Mail nicht gefunden.
es: Email no encontrado.

source: Invalid or expired token
de: Ungültiger oder abgelaufener Token
es: Token no válido o caducado

source: Passwords must match
de: Passwörter müssen übereinstimmen
es: Las contraseñas deben coincidir

source: Your password has been updated!
de: Ihr Passwort wurde aktualisiert!
es: ¡Tu contraseña ha sido actualizada!

source: Create this recipe
de: Dieses Rezept erstellen

source: Sorry, I encountered an error. Please try again.
de: Entschuldigung, es ist ein Fehler aufgetreten. Bitte versuchen Sie es erneut.

source: Recipe from conversation
de: Rezept aus dem Gespräch

source: Recipe discussed in chat
de: Im Chat besprochenes Rezept

source: ingredient | amount
de: Zutat | Menge

source: Add instructions here
de: Fügen Sie hier Anweisungen hinzu

source: chat, custom
de: Chat, benutzerdefiniert

source: Please log in to see your recipes.
de: Bitte melden Sie sich an, um Ihre Rezepte zu sehen.
es: Por favor, inicia sesión para ver tus recetas.

source: Recipe data required
de: Rezeptdaten erforderlich
es: Datos de receta requeridos

source: Profile updated successfully!
de: Profil erfolgreich aktualisiert!
es: ¡Perfil actualizado con éxito!

source: Incorrect old password.
de: Falsches altes Passwort.
es: Contraseña anterior incorrecta.

source: New passwords do not match.
de: Neue Passwörter stimmen nicht überein.
es: Las nuevas contraseñas no coinciden.

source: Password must be at least 8 characters long.
de: Das Passwort muss mindestens 8 Zeichen lang sein.
es: La contraseña debe tener al menos 8 caracteres.

source: Password updated successfully!
de: Passwort erfolgreich aktualisiert!
es: ¡Contraseña actualizada con éxito!

source: You are not allowed to view this recipe.
de: Sie dürfen dieses Rezept nicht ansehen.
es: No tienes permiso para ver esta receta.

source: Image uploaded and optimized successfully!
de: Bild erfolgreich hochgeladen und optimiert!
es: ¡Imagen subida y optimizada con éxito!

source: Error processing image. Recipe saved without image.
de: Fehler bei der Bildverarbeitung. Rezept ohne Bild gespeichert.
es: Error al procesar la imagen. Receta guardada sin imagen.

source: Recipe created successfully!
de: Rezept erfolgreich erstellt!
es: ¡Receta creada con éxito!

source: Error creating recipe: %(error)s
de: Fehler beim Erstellen des Rezepts: %(error)s
es: Error al crear la receta: %(error)s

source: You don't have permission to modify this recipe.
de: Sie haben keine Berechtigung, dieses Rezept zu ändern.
es: No tienes permiso para modificar esta receta.

source: You don't have permission to translate this recipe.
de: Sie haben keine Berechtigung, dieses Rezept zu übersetzen.
es: No tienes permiso para traducir esta receta.

source: Invalid language selected.
de: Ungültige Sprache ausgewählt.
es: Idioma seleccionado no válido.

source: Recipe translated successfully! Review and save changes.
de: Rezept erfolgreich übersetzt! Überprüfen und speichern Sie die Änderungen.
es: ¡Receta traducida con éxito! Revisa y guarda los cambios.

source: Error translating recipe: %(error)s
de: Fehler beim Übersetzen des Rezepts: %(error)s
es: Error al traducir la receta: %(error)s

source: Please change your language preference in settings
de: Bitte ändern Sie Ihre Spracheinstellung in den Einstellungen
es: Por favor, cambia tu preferencia de idioma en la configuración

source: Please select at least one recipe
de: Bitte wählen Sie mindestens ein Rezept aus
es: Por favor, selecciona al menos una receta

source: No recipes found
de: Keine Rezepte gefunden
es: No se encontraron recetas

source: Cookbook PDF generated successfully! (%(count)d recipes)
de: Kochbuch-PDF erfolgreich erstellt! (%(count)d Rezepte)
es: ¡PDF del recetario generado con éxito! (%(count)d recetas)

source: No recipes selected
de: Keine Rezepte ausgewählt
es: No hay recetas seleccionadas

source: %(count)d recipe(s) deleted successfully
de: %(count)d Rezept(e) erfolgreich gelöscht
es: %(count)d receta(s) eliminada(s) con éxito

source: Tag is required
de: Tag ist erforderlich
es: La etiqueta es obligatoria

source: Tag "%(tag)s" added to %(count)d recipe(s)
de: Tag "%(tag)s" zu %(count)d Rezept(en) hinzugefügt
es: Etiqueta "%(tag)s" añadida a %(count)d receta(s)

source: AI Recipe Generator
de: KI-Rezeptgenerator
es: Generador de Recetas con IA

source: Recipe App
de: Rezept-App
es: App de Recetas

source: Let AI create delicious recipes from your ingredients
de: Lassen Sie KI aus Ihren Zutaten köstliche Rezepte erstellen
es: Deja que la IA cree deliciosas recetas con tus ingredientes

source: Ingredients
de: Zutaten
es: Ingredientes

source: Your Ingredients
de: Ihre Zutaten
es: Tus Ingredientes

source: chicken breast, cream, onion, pepper, avocado, yoghurt...
de: Hähnchenbrust, Sahne, Zwiebel, Pfeffer, Avocado, Joghurt...
es: pechuga de pollo, nata, cebolla, pimiento, aguacate, yogur...

source: Separate ingredients with commas
de: Zutaten mit Kommas trennen
es: Separa los ingredientes con comas

source: Number of Ideas:
de: Anzahl der Ideen:
es: Número de Ideas:

source: Use
de: Verwende
es: Usar

source: only
de: nur
es: solo

source: these ingredients
de: diese Zutaten
es: estos ingredientes

source: common kitchen staples
de: übliche Küchenzutaten
es: ingredientes básicos de cocina

source: Generate Dish Ideas
de: Generiere Gerichtideen
es: Generar Ideas de Platos

source: Generating ideas...
de: Generiere Ideen...
es: Generando ideas...

source: Recent Searches
de: Letzte Suchen
es: Búsquedas Recientes

source: Clear
de: Löschen
es: Limpiar

source: Ready to cook something amazing?
de: Bereit, etwas Fantastisches zu kochen?
es: ¿Listo para cocinar algo increíble?

source: Enter your ingredients and let AI inspire you!
de: Geben Sie Ihre Zutaten ein und lassen Sie sich von KI inspirieren!
es: ¡Introduce tus ingredientes y deja que la IA te inspire!

source: Dish Ideas
de: Gerichtideen
es: Ideas de Platos

source: Generate Recipe
de: Rezept generieren
es: Generar Receta

source: New Search
de: Neue Suche
es: Nueva Búsqueda

source: Creating your recipe...
de: Erstelle Ihr Rezept...
es: Creando tu receta...

source: Edit Your Recipe
de: Bearbeiten Sie Ihr Rezept
es: Editar Tu Receta

source: Recipe Title
de: Rezepttitel
es: Título de la Receta

source: Description
de: Beschreibung
es: Descripción

source: Servings
de: Portionen
es: Porciones

source: ingredient | description
de: Zutat | Beschreibung
es: ingrediente | descripción

source: (one per line)
de: (eine pro Zeile)
es: (uno por línea)

source: Instructions
de: Anleitung
es: Instrucciones

source: One step per line
de: Ein Schritt pro Zeile
es: Un paso por línea

source: Notes
de: Notizen
es: Notas

source: One note per line
de: Eine Notiz pro Zeile
es: Una nota por línea

source: Comma-separated
de: Durch Kommas getrennt
es: Separadas por comas

source: Save Recipe
de: Rezept speichern
es: Guardar Receta

source: Back to Ideas
de: Zurück zu den Ideen
es: Volver a Ideas

source: Home
de: Startseite
es: Inicio

source: Table View
de: Tabellenansicht
es: Vista de Tabla

source: Search
de: Suchen
es: Buscar

source: Create Cookbook
de: Kochbuch erstellen
es: Crear Recetario

source: AI Tools
de: KI-Werkzeuge
es: Herramientas de IA

source: Generate Recipes
de: Rezepte generieren
es: Generar Recetas

source: Digitaliser
de: Digitalisierung
es: Digitalizador

source: New Recipe
de: Neues Rezept
es: Nueva Receta

source: Settings
de: Einstellungen
es: Configuración

source: Logout
de: Abmelden
es: Cerrar Sesión

source: Login
de: Anmelden
es: Iniciar Sesión

source: Toggle dropdown menu
de: Dropdown-Menü umschalten
es: Abrir/cerrar menú desplegable

source: Error sending message
de: Fehler beim Senden der Nachricht

source: Clear all messages?
de: Alle Nachrichten löschen?

source: Error clearing chat
de: Fehler beim Löschen des Chats

source: Recipe Digitaliser
de: Rezept-Digitalisierer
es: Digitalizador de Recetas

source: Transform handwritten recipes into digital format with AI-powered OCR
de: Wandeln Sie handgeschriebene Rezepte mit KI-gestützter OCR in ein digitales Format um.
es: Transforma recetas manuscritas a formato digital con OCR basado en IA

source: Upload Recipe Image
de: Rezeptbild hochladen
es: Subir Imagen de Receta

source: Click to upload
de: Zum Hochladen klicken
es: Haz clic para subir

source: or drag and drop
de: oder per Drag & Drop
es: o arrastra y suelta

source: Process Image
de: Bild verarbeiten

source: Processing image...
de: Bild wird verarbeitet...

source: 💡 Tips for Best Results
de: 💡 Tipps für beste Ergebnisse
es: 💡 Consejos para Mejores Resultados

source: ✓ Use clear, well-lit photos
de: ✓ Verwenden Sie klare, gut beleuchtete Fotos
es: ✓ Usa fotos claras y bien iluminadas

source: ✓ Keep handwriting legible
de: ✓ Achten Sie auf leserliche Handschrift
es: ✓ Mantén la escritura a mano legible

source: ✓ Include all ingredients and steps
de: ✓ Fügen Sie alle Zutaten und Schritte hinzu
es: ✓ Incluye todos los ingredientes y pasos

source: ✓ Avoid blurry or angled photos
de: ✓ Vermeiden Sie unscharfe oder schräge Fotos
es: ✓ Evita fotos borrosas o en ángulo

source: Ready to digitalise a recipe?
de: Bereit ein Rezept zu digitalisieren?
es: ¿Listo para digitalizar una receta?

source: Upload a photo of your handwritten recipe and let AI do the work!
de: Laden Sie ein Foto Ihres handgeschriebenen Rezepts hoch und lassen Sie die KI die Arbeit machen!
es: ¡Sube una foto de tu receta manuscrita y deja que la IA haga el trabajo!

source: Digitising your recipe...
de: Digitalisiere Ihr Rezept...

source: This may take a moment
de: Dies kann einen Moment dauern
es: Esto puede tardar un momento

source: Edit Recipe
de: Rezept bearbeiten
es: Editar Receta

source: Extracted Text
de: Extrahierter Text
es: Texto Extraído

source: 💾 Save Recipe
de: 💾 Rezept speichern

source: Error saving recipe:
de: Fehler beim Speichern des Rezepts:

source: Network error:
de: Netzwerkfehler
es: Error de red:

source: Discard this recipe and start over?
de: Dieses Rezept verwerfen und neu beginnen?
es: ¿Descartar esta receta y empezar de nuevo?

source: Image Statistics
de: Bildstatistiken
es: Estadísticas de Imágenes

source: Total Recipes
de: Gesamtanzahl Rezepte
es: Recetas Totales

source: Recipes with Images
de: Rezepte mit Bildern
es: Recetas con Imágenes

source: Image Files
de: Bilddateien
es: Archivos de Imagen

source: Total Image Size
de: Gesamte Bildgröße
es: Tamaño Total de Imágenes

source: Thumbnails
de: Vorschaubilder
es: Miniaturas

source: Thumbnail Size
de: Vorschaubildgröße
es: Tamaño de Miniaturas

source: Optimization Benefits
de: Optimierungsvorteile
es: Beneficios de Optimización

source: Images automatically resized to maximum 800x800px
de: Bilder werden automatisch auf maximal 800x800px angepasst
es: Imágenes redimensionadas automáticamente a máximo 800x800px

source: Thumbnails created at 300x300px for fast loading
de: Vorschaubilder werden für schnelles Laden in 300x300px erstellt
es: Miniaturas creadas a 300x300px para carga rápida

source: JPEG quality optimized to 85%
de: JPEG-Qualität auf 85% optimiert
es: Calidad JPEG optimizada al 85%

source: Lazy loading on image cards
de: Verzögertes Laden bei Bildkarten
es: Carga diferida en tarjetas de imágenes

source: Fallback to original if thumbnail missing
de: Rückgriff auf Original bei fehlendem Vorschaubild
es: Uso de original si falta la miniatura

source: Back to Recipes
de: Zurück zu den Rezepten
es: Volver a Recetas

source: My Recipes
de: Meine Rezepte

source: Browse your delicious recipe collection
de: Durchstöbern Sie Ihre köstliche Rezeptsammlung

source: Quick search recipes...
de: Rezepte schnell durchsuchen...

source: Advanced Search
de: Erweiterte Suche

source: No recipes yet
de: Noch keine Rezepte vorhanden

source: Start building your collection!
de: Beginnen Sie mit dem Aufbau Ihrer Sammlung
es: ¡Empieza a construir tu colección!

source: Create Your First Recipe
de: Erstellen Sie Ihr erstes Rezept

source: Create PDF Cookbook
de: PDF-Kochbuch erstellen
es: Crear Recetario PDF

source: Select recipes to include in your cookbook
de: Wählen Sie Rezepte für Ihr Kochbuch aus
es: Selecciona las recetas para incluir en tu recetario

source: Cookbook Title
de: Kochbuchtitel
es: Título del Recetario

source: My Recipe Collection
de: Meine Rezeptsammlung
es: Mi Colección de Recetas

source: e.g., Autumn Comfort Food Collection
de: z.B. Herbstliche Wohlfühlrezepte
es: p.ej., Colección de Recetas de Otoño

source: Select All
de: Alle auswählen
es: Seleccionar Todo

source: Select None
de: Keine auswählen
es: Seleccionar Ninguno

source: %(count)d recipes selected
de: %(count)d Rezepte ausgewählt
es: %(count)d recetas seleccionadas

source: Generate PDF Cookbook
de: PDF-Kochbuch generieren
es: Generar Recetario PDF

source: 🍽️ %(servings)d servings
de: 🍽️ %(servings)d Portionen
es: 🍽️ %(servings)d porciones

source: 📝 %(steps)d steps
de: 📝 %(steps)d Schritte
es: 📝 %(steps)d pasos

source: Create some recipes first!
de: Erstellen Sie zuerst einige Rezepte!

source: Back to recipes
de: Zurück zu den Rezepten
es: Volver a recetas

source: servings
de: Portionen
es: porciones

source: steps
de: Schritte
es: pasos

source: ingredients
de: Zutaten
es: ingredientes

source: Download PDF
de: PDF herunterladen
es: Descargar PDF

source: Translate Recipe
de: Rezept übersetzen
es: Traducir Receta

source: English
de: Englisch
es: Inglés

source: Spanish (Español)
de: Spanisch (Español)
es: Español

source: German (Deutsch)
de: Deutsch
es: Alemán (Deutsch)

source: Turkish (Türkçe)
de: Türkisch (Türkçe)
es: Turco (Türkçe)

source: Are you sure you want to delete this recipe?
de: Sind Sie sicher, dass Sie dieses Rezept löschen möchten?
es: ¿Estás seguro de que quieres eliminar esta receta?

source: Delete
de: Löschen
es: Eliminar

source: Save to My Profile
de: In meinem Profil speichern
es: Guardar en Mi Perfil

source: Translating Recipe...
de: Übersetze Rezept...
es: Traduciendo Receta...

source: Please wait while we translate your recipe.
de: Bitte warten Sie, während wir Ihr Rezept übersetzen.
es: Por favor, espera mientras traducimos tu receta.

source: Saved!
de: Gespeichert!
es: ¡Guardado!

source: Edit
de: Bearbeiten
es: Editar

source: New
de: Neu
es: Nueva

source: Recipe
de: Rezept
es: Receta

source: Translation Preview
de: Übersetzungsvorschau
es: Vista Previa de Traducción

source: Review the translated content below and make any adjustments before saving.
de: Überprüfen Sie die übersetzte Version unten und nehmen Sie Anpassungen vor dem Speichern vor.
es: Revisa el contenido traducido a continuación y realiza ajustes antes de guardar.

source: Show Original
de: Original anzeigen
es: Mostrar Original

source: Original Content
de: Originalinhalt
es: Contenido Original

source: TITLE:
de: TITEL:
es: TÍTULO:

source: DESCRIPTION:
de: BESCHREIBUNG:
es: DESCRIPCIÓN:

source: INGREDIENTS:
de: ZUTATEN:
es: INGREDIENTES:

source: INSTRUCTIONS:
de: ANLEITUNG:
es: INSTRUCCIONES:

source: NOTES:
de: NOTIZEN:
es: NOTAS:

source: Recipe from Chat
de: Rezept aus dem Chat

source: Review and edit the recipe details from your conversation before saving.
de: Überprüfen und bearbeiten Sie die Rezeptdetails aus Ihrem Gespräch, bevor Sie sie speichern.

source: Create New Recipe
de: Neues Rezept erstellen
es: Crear Nueva Receta

source: e.g., Pasta with Pumpkin Sauce
de: z.B. Pasta mit Kürbissoße
es: p.ej., Pasta con Salsa de Calabaza

source: A brief description of your recipe...
de: Eine kurze Beschreibung Ihres Rezepts...
es: Una breve descripción de tu receta...

source: pasta | 500 g tagliatelle
de: Nudeln | 500 g Tagliatelle
es: pasta | 500 g de tagliatelle

source: pumpkin | 600 g Hokkaido, cubed
de: Kürbis | 600 g Hokkaido, gewürfelt
es: calabaza | 600 g de Hokkaido, en cubos

source: olive oil | 4 tbsp
de: Olivenöl | 4 EL
es: aceite de oliva | 4 cucharadas

source: You can use Hokkaido pumpkin...
de: Sie können Hokkaido-Kürbis verwenden...
es: Puedes usar calabaza Hokkaido...

source: Store leftovers in the fridge...
de: Reste im Kühlschrank aufbewahren...
es: Guardar las sobras en la nevera...

source: Comma-separated:
de: Durch Kommas getrennt:
es: Separadas por comas:

source: vegetarian, pasta, Italian
de: vegetarisch, Pasta, italienisch
es: vegetariano, pasta, italiano

source: vegetarian, pasta, main course
de: vegetarisch, Pasta, Hauptgericht
es: vegetariano, pasta, plato principal

source: Recipe Image
de: Rezeptbild
es: Imagen de la Receta

source: Upload a new image to replace the current one
de: Laden Sie ein neues Bild hoch, um das aktuelle zu ersetzen
es: Subir una nueva imagen para reemplazar la actual

source: PNG, JPG, GIF, WebP up to 16MB
de: PNG, JPG, GIF, WebP bis zu 16MB
es: PNG, JPG, GIF, WebP hasta 16MB

source: Preview
de: Vorschau
es: Vista Previa

source: Remove preview
de: Vorschau entfernen
es: Eliminar vista previa

source: Are you sure you want to delete this image?
de: Sind Sie sicher, dass Sie dieses Bild löschen möchten?
es: ¿Estás seguro de que quieres eliminar esta imagen?

source: Image deleted successfully
de: Bild erfolgreich gelöscht
es: Imagen eliminada con éxito

source: Error deleting image:
de: Fehler beim Löschen des Bildes:
es: Error al eliminar la imagen:

source: Error deleting image
de: Fehler beim Löschen des Bildes
es: Error al eliminar la imagen

source: Update Recipe
de: Rezept aktualisieren
es: Actualizar Receta

source: Create Recipe
de: Rezept erstellen
es: Crear Receta

source: Cancel
de: Abbrechen
es: Cancelar

source: Search Recipes
de: Rezepte suchen
es: Buscar Recetas

source: Find your perfect recipe
de: Finden Sie Ihr perfektes Rezept
es: Encuentra tu receta perfecta

source: Search Everything
de: Alles durchsuchen
es: Buscar Todo

source: Type to search...
de: Suchbegriff eingeben...
es: Escribe para buscar...

source: Searching...
de: Suche...
es: Buscando...

source: Search by Tag
de: Nach Tag suchen
es: Buscar por Etiqueta

source: Popular Tags
de: Beliebte Tags
es: Etiquetas Populares

source: Clear Filters
de: Filter zurücksetzen
es: Limpiar Filtros

source: Start searching
de: Suche starten
es: Empezar a buscar

source: Enter a search term or click a tag to find recipes
de: Geben Sie einen Suchbegriff ein oder klicken Sie auf einen Tag, um Rezepte zu finden
es: Introduce un término de búsqueda o haz clic en una etiqueta para encontrar recetas

source: Recipe Table
de: Rezepttabelle

source: Recipe Table View
de: Rezept-Tabellenansicht

source: Manage all your recipes in one place
de: Verwalten Sie alle Ihre Rezepte an einem Ort
es: Gestiona todas tus recetas en un solo lugar

source: Add Tag
de: Tag hinzufügen
es: Añadir Etiqueta

source: Export CSV
de: Als CSV exportieren
es: Exportar CSV

source: Unique Tags
de: Eindeutige Tags
es: Etiquetas Únicas

source: Title
de: Titel
es: Título

source: Steps
de: Schritte
es: Pasos

source: Created
de: Erstellt
es: Creado

source: Actions
de: Aktionen
es: Acciones

source: Add Tag to Selected Recipes
de: Tag zu ausgewählten Rezepten hinzufügen

source: Enter tag name
de: Tag-Namen eingeben
es: Ingresa el nombre de la etiqueta

source: Apply
de: Anwenden
es: Aplicar

source: Error:
de: Fehler:

source: Account Settings
de: Kontoeinstellungen
es: Ajustes de la Cuenta

source: Profile Information
de: Profilinformationen
es: Información del Perfil

source: First Name
de: Vorname
es: Nombre

source: Last Name
de: Nachname
es: Apellido

source: Preferred Language
de: Bevorzugte Sprache
es: Idioma Preferido

source: Profile Picture
de: Profilbild
es: Foto de Perfil

source: Save Changes
de: Änderungen speichern
es: Guardar Cambios

source: Change Password
de: Passwort ändern
es: Cambiar Contraseña

source: Old Password
de: Altes Passwort
es: Contraseña Anterior

source: New Password
de: Neues Passwort
es: Nueva Contraseña

source: Confirm New Password
de: Neues Passwort bestätigen
es: Confirmar Nueva Contraseña

source: Update Password
de: Passwort aktualisieren
es: Actualizar Contraseña

source: Username
de: Benutzername
es: Nombre de Usuario

source: Password
de: Passwort
es: Contraseña

source: Log In
de: Anmelden
es: Iniciar Sesión

source: No account?
de: Kein Konto?
es: ¿No tienes cuenta?

source: Register here
de: Hier registrieren
es: Regístrate aquí

source: Register
de: Registrieren
es: Registrarse

source: Confirm Password
de: Passwort bestätigen
es: Confirmar Contraseña

source: Already have an account?
de: Bereits ein Konto?
es: ¿Ya tienes una cuenta?

source: Log in
de: Anmelden
es: Iniciar sesión

source: Cooking Assistant
de: Kochassistent

source: Clear conversation
de: Konversation löschen

source: View Recipe
de: Rezept ansehen
es: Ver Receta

source: Results for "%(query)s"
de: Ergebnisse für "%(query)s"
es: Resultados para "%(query)s"

source: Recipes tagged with "%(tag)s"
de: Rezepte mit Tag "%(tag)s"
es: Recetas etiquetadas con "%(tag)s"

source: %(count)d recipe(s) found
de: %(count)d Rezept(e) gefunden
es: %(count)d receta(s) encontrada(s)

source: No tags yet
de: Noch keine Tags
es: Aún no hay etiquetas

source: Failed to generate dish ideas: %(error)s
de: Fehler beim Generieren von Gerichtideen: %(error)s
es: Error al generar ideas de platos: %(error)s

source: Missing required field: %(field)s
de: Erforderliches Feld fehlt: %(field)s
es: Campo requerido faltante: %(field)s

source: Failed to generate recipe: %(error)s
de: Fehler beim Generieren des Rezepts: %(error)s
es: Error al generar la receta: %(error)s

source: Untitled Recipe
de: Unbenanntes Rezept
es: Receta sin Título

source: AI-generated
de: KI-generiert
es: Generado por IA

source: Format:
es: Formato:

source: Tags
es: Etiquetas

source: Optional
es: Opcional

source: Email
es: Correo Electrónico

source: COOK_AGENT_KEY and AGENT_ID must be set in environment
es: COOK_AGENT_KEY y AGENT_ID deben estar configurados en el entorno
